liqili2009/--/CAMERA/Utilities/STM32_EVAL/STM322xG_EVAL/stm322xg_eval_ioe_uda1380.c
/**
  ******************************************************************************
  * @file    stm322xg_eval_ioe.c
  * @author  MCD Application Team
  * @version V4.6.1
  * @date    18-April-2011
  * @brief   This file provides a set of functions needed to manage the STMPE811
  *          IO Expander devices mounted on STM322xG-EVAL evaluation board(MB786)
  *          RevA and RevB.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************  
  */ 

  /* File Info : ---------------------------------------------------------------
  
    Note:
    -----
    - This driver uses the DMA method for sending and receiving data on I2C bus
      which allow higher efficiency and reliability of the communication.  
  
      SUPPORTED FEATURES:
      - IO Read/write : Set/Reset and Read (Polling/Interrupt)
      - Joystick: config and Read (Polling/Interrupt)
      - Audio Features:Reset(output)
      - Camera Feature: Reset(output),Plug(output)
	  - Mems Feature: Int1(input),Int2(input)
  ----------------------------------------------------------------------------*/

/* Includes ------------------------------------------------------------------*/
#include "stm322xg_eval_ioe_uda1380.h"

/** @addtogroup Utilities
  * @{
  */

/** @addtogroup STM32_EVAL
  * @{
  */ 

/** @addtogroup STM322xG_EVAL
  * @{
  */
    
/** @defgroup STM322xG_EVAL_IOE 
  * @brief  This file includes the IO Expander driver for CAT9554 IO Expander 
  *         devices.
  * @{
  */ 
  

/** @defgroup STM322xG_EVAL_IOE_Private_TypesDefinitions
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup STM322xG_EVAL_IOE_Private_Defines
  * @{
  */ 
#define TIMEOUT_MAX    0x3000 /*<! The value of the maximal timeout for I2C waiting loops */
/**
  * @}
  */ 


/** @defgroup STM322xG_EVAL_IOE_Private_Macros
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup STM322xG_EVAL_IOE_Private_Variables
  * @{
  */ 
uint32_t IOE_TimeOut = TIMEOUT_MAX; /*<! Value of Timeout when I2C communication fails */
/**
  * @}
  */ 


/** @defgroup STM322xG_EVAL_IOE_Private_FunctionPrototypes
  * @{
  */ 
static void IOE_GPIO_Config(void);
static void IOE_I2C_Config(void);
static void IOE_DMA_Config(IOE_DMADirection_TypeDef Direction, uint8_t* buffer);
static void IOE_EXTI_Config(void);

#if 0//ndef USE_Delay
static void delay(__IO uint32_t nCount);
#endif /* USE_Delay*/
/**
  * @}
  */ 


/** @defgroup STM322xG_EVAL_IOE_Private_Functions
  * @{
  */ 


/**
  * @brief  Initializes and Configures the two IO_Expanders Functionalities 
  *         (IOs, Touch Screen ..) and configures all STM322xG_EVAL necessary
  *         hardware (GPIOs, APB clocks ..).
  * @param  None
  * @retval IOE_OK if all initializations done correctly. Other value if error.
  */
uint8_t IOE_Config(void)
{
  /* Configure the needed pins */
  IOE_GPIO_Config(); 
  
  IOE_I2C_Config();
    
  /* ---------------------- IO Expander 1 configuration --------------------- */
  /* Configure the MEMS interrupt pins in Input mode */
  IOE_IOPinConfig(IOE_1_ADDR, (uint8_t)(MEMS_INT1_PIN | MEMS_INT2_PIN), Direction_IN); 
  /* Configure the Camera Reset pin and Plug pin in output mode pin*/
  IOE_IOPinConfig(IOE_1_ADDR, (uint8_t)(CAMERA_RESET_PIN | CAMERA_PLUG_PIN), Direction_OUT);
  /* Apply the default state for the out pins */
  IOE_WriteIOPin(IOE_1_ADDR, CAMERA_RESET_PIN, BitSet);
  IOE_WriteIOPin(IOE_1_ADDR, CAMERA_PLUG_PIN, BitReset);
  /* ------------------------------------------------------------------------ */
  
  /* ---------------------- IO Expander 2 configuration --------------------- */
  /* Configure the Joystick pins in Input mode */
  IOE_IOPinConfig(IOE_2_ADDR, IOE_JOY_IO_PINS , Direction_IN); 
  /* Configure the Audio Codec Reset pin in output mode pin*/
  IOE_IOPinConfig(IOE_2_ADDR, (uint32_t)(AUDIO_RESET_PIN), Direction_OUT); 
  /* Apply the default state for the out pins */
  IOE_WriteIOPin(IOE_2_ADDR, AUDIO_RESET_PIN, BitSet);   
  /* ------------------------------------------------------------------------ */
  
  /* Configuration is OK */
  return IOE_OK; 
}

/**
  * @brief  Configures The selected interrupts on the IO Expanders.
  * @param  IOE_ITSRC_Source: the source of the interrupts. Could be one or a 
  *         combination of the following parameters:
  *   @arg  IOE_ITSRC_JOYSTICK: Joystick IO intputs.
  *   @arg  IOE_ITSRC_INMEMS: MEMS interrupt lines.
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_ITConfig(uint8_t IOE_ITSRC_Source)
{   
  /* Manage the Joystick Interrupts */  
  if (IOE_ITSRC_Source & IOE_ITSRC_JOYSTICK)
  {     
    /* Enable the Joystick pins to generate interrupt (infact IO pin in) */
    IOE_IOITConfig(IOE_2_ADDR, IOE_JOY_IT, ENABLE);         
  }

  /* Manage the MEMS Interrupts lines  */  
  if (IOE_ITSRC_Source & IOE_ITSRC_INMEMS)
  {
    /* Enable the pins to generate interrupt (infact IO pin in) */
    IOE_IOITConfig(IOE_1_ADDR, IOE_MEMS_IT, ENABLE);        
  }    
    
  /* Configure the Interrupt line as EXTI source */
  IOE_EXTI_Config();    
  
  /* If all OK return IOE_OK */
  return IOE_OK;
}

/**
  * @brief  Writes a bit value to an output IO pin.
  * @param IO_Pin: The output pin to be set or reset. This parameter can be one 
  *        of the following values:
  *   @arg  AUDIO_RESET_PIN: Audio codec reset pin
  *   @arg  MII_INT_PIN: Ethernet Phy MII interrupt pin
  *   @arg  VBAT_DIV_PIN: Battery divider pin
  * @param BitVal: The value to be set. This parameter can be one of the
  *        following values: BitSet or BitReset. See IOE_BitVal_TypeDef.
  * @retval IOE_OK or PARAM_ERROR
  */
uint8_t IOE_WriteIOPin(uint8_t DeviceAddr, uint8_t IO_Pin, IOE_BitValue_TypeDef BitVal)
{
  //uint8_t DeviceAddr = 0;
  uint8_t tmp = 0;
 
  /* get the Interrupt status */
  tmp = I2C_ReadDeviceRegister(DeviceAddr, IOE_CAT9554_REG_OUTPUT);
  /* Get the IO expander Address according to which pin is to be controlled */
 /* if (IO_Pin & IO1_OUT_ALL_PINS)
  {
    DeviceAddr = IOE_1_ADDR;
  }
  else if (IO_Pin & IO2_OUT_ALL_PINS)
  {
    DeviceAddr = IOE_2_ADDR;
  }
  else
  {
    return PARAM_ERROR;
  }	 */
  
  /* Apply the bit value to the selected pin */
  if (BitVal == BitReset)
  {
    tmp&=~(uint8_t)IO_Pin;
    /* Set the register */
    I2C_WriteDeviceRegister(DeviceAddr, IOE_CAT9554_REG_OUTPUT, tmp);
  }
  else
  {
	tmp|=(uint8_t)IO_Pin;
    /* Set the register */
    I2C_WriteDeviceRegister(DeviceAddr, IOE_CAT9554_REG_OUTPUT, tmp);
  }
  
