liqili2009/--/CAMERA/Utilities/STM32_EVAL/STM322xG_EVAL/stm322xg_eval_ioe_uda1380.c
  return IOE_OK;
}


/**
  * @brief  Returns the status of the selected input IO pin.
  * @param IO_Pin: The input pin to be read. This parameter can be one 
  *  of the following values:
  *   @arg  MEMS_INT1_PIN: MEMS interrupt line 1.
  *   @arg  MEMS_INT2_PIN: MEMS interrupt line 2.
  *   @arg  JOY_IO_PINS: Joystick IO pins (use IOE_JoyStickGetState for these pins)  
  * @retval None
  */
uint8_t IOE_ReadIOPin(uint8_t DeviceAddr, uint8_t IO_Pin)
{
  //uint8_t DeviceAddr = 0;
  uint8_t tmp = 0;  
  /*if (IO_Pin & IO1_IN_ALL_PINS)
  {
    DeviceAddr = IOE_1_ADDR;
  }
  else if (IO_Pin & IO2_IN_ALL_PINS)
  {
    DeviceAddr = IOE_2_ADDR;
  }
  else 
  {
    return PARAM_ERROR;
  }	*/
  
  /* Get all the Pins status */
  tmp = I2C_ReadDeviceRegister(DeviceAddr, IOE_CAT9554_REG_INPUT);
  if ((tmp & (uint8_t)IO_Pin) != 0)
  {
    return BitSet;
  }  
  else 
  {
    return BitReset;
  }
}
/**
  * @brief  Returns the current Mems status.
  * @param  None
  * @retval The code of the Joystick key pressed: 
  *   @arg  MEMS_NONE
  *   @arg  MEMS_INT1
  *   @arg  MEMS_INT2
  */
#if 0
MEMSINTState_TypeDef IOE_MemsIntGetState(void)
{
  uint8_t tmp = 0;
  /* Read the status of all pins */
  tmp = (uint32_t)I2C_ReadDeviceRegister(IOE_1_ADDR, IOE_CAT9554_REG_INPUT);
   
  /* Check the pressed keys */
  if ((tmp & IOE_MEMSINT_IO_NONE) == IOE_MEMSINT_IO_NONE)
  {
    return (MEMSINTState_TypeDef) MEMSINT_NONE;
  }
  else if (!(tmp & IOE_MEMSINT_IO_INT1))
  {
    return (MEMSINTState_TypeDef) MEMSINT_1;
  }
  else if (!(tmp & IOE_MEMSINT_IO_INT2))
  {
    return (MEMSINTState_TypeDef) MEMSINT_2;
  }	  
  else
  { 
    return (MEMSINTState_TypeDef) MEMSINT_NONE;
  }
}
  #endif
/**
  * @brief  Returns the current Joystick status.
  * @param  None
  * @retval The code of the Joystick key pressed: 
  *   @arg  JOY_NONE
  *   @arg  JOY_SEL
  *   @arg  JOY_DOWN
  *   @arg  JOY_LEFT
  *   @arg  JOY_RIGHT
  *   @arg  JOY_UP
  */
JOYState_TypeDef IOE_JoyStickGetState(void)
{
  uint8_t tmp = 0;
  /* Read the status of all pins */
  tmp = (uint32_t)I2C_ReadDeviceRegister(IOE_2_ADDR, IOE_CAT9554_REG_INPUT);
   
  /* Check the pressed keys */
  if ((tmp & IOE_JOY_IO_NONE) == IOE_JOY_IO_NONE)
  {
    return (JOYState_TypeDef) JOY_NONE;
  }
  else if (!(tmp & IOE_JOY_IO_SEL))
  {
    return (JOYState_TypeDef) JOY_SEL;
  }
  else if (!(tmp & IOE_JOY_IO_DOWN))
  {
    return (JOYState_TypeDef) JOY_DOWN;
  }
  else if (!(tmp & IOE_JOY_IO_LEFT))
  {
    return (JOYState_TypeDef) JOY_LEFT;
  }
  else if (!(tmp & IOE_JOY_IO_RIGHT))
  {
    return (JOYState_TypeDef) JOY_RIGHT;
  }
  else if (!(tmp & IOE_JOY_IO_UP))
  {
    return (JOYState_TypeDef) JOY_UP;
  }
  else
  { 
    return (JOYState_TypeDef) JOY_NONE;
  }
}
/**
  * @brief  Checks the status of the selected IO interrupt pending bit
  * @param  DeviceAddr: The address of the IOExpander, could be : IOE_1_ADDR
  *         or IOE_2_ADDR.
  * @param  IO_Pin: the IO level to be checked could be IO_Pinx Where x can be 
  *         from 0 to 7.             
  * @retval Status of the checked flag. Could be SET or RESET.
  */
FlagStatus IOE_GetITIOStatus(uint8_t DeviceAddr, uint8_t IO_Pin)
{
  uint8_t tmp = 0;
 
  /* get the Interrupt status */
  tmp = I2C_ReadDeviceRegister(DeviceAddr, IOE_CAT9554_REG_INPUT);
  
  if ((tmp & (uint8_t)IO_Pin) != 0)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}


/**
  * @brief  Configures the selected pin direction (to be an input or an output)
  * @param  DeviceAddr: The address of the IOExpander, could be : IOE_1_ADDR
  *         or IOE_2_ADDR.
  * @param  IO_Pin: IO_Pin_x: Where x can be from 0 to 7.   
  * @param  Direction: could be Direction_IN or Direction_OUT.      
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_IOPinConfig(uint8_t DeviceAddr, uint8_t IO_Pin, uint8_t Direction)
{
  uint8_t tmp = 0;   
  
  /* Get all the Pins direction */
  tmp = I2C_ReadDeviceRegister(DeviceAddr, IOE_CAT9554_REG_CONFIG);
  
  if (Direction != Direction_IN)
  {
    tmp &= ~(uint8_t)IO_Pin;
  }  
  else 
  {
    tmp |= (uint8_t)IO_Pin;	 
  }
  
  /* Write the register new value */
  I2C_WriteDeviceRegister(DeviceAddr, IOE_CAT9554_REG_CONFIG, tmp);
  
  /* If all OK return IOE_OK */
  return IOE_OK;      
}

/**
  * @brief  Configures the selected pins to generate an interrupt or not.
  * @param  DeviceAddr: The address of the IOExpander, could be : IOE_1_ADDR
  *         or IOE_2_ADDR.
  * @param  IO_Pin: The IO interrupt to be configured. This parameter could be any
  *         combination of the following values:
  *   @arg  IO_Pin_x: where x can be from 0 to 7.
  * @param  NewState: could be ENABLE or DISABLE.  
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_IOITConfig(uint8_t DeviceAddr, uint8_t IO_Pin, FunctionalState NewState)
{
  uint8_t tmp = 0;
 
  /* Get all the Pins direction */
  tmp = I2C_ReadDeviceRegister(DeviceAddr, IOE_CAT9554_REG_CONFIG);
  
  if (NewState != DISABLE)
  {
    /* Set the interrupts to be Enabled */    
    tmp |= (uint8_t)IO_Pin;
  }
  else
  {
    /* Set the interrupts to be Disabled */    
    tmp &= ~(uint8_t)IO_Pin;
  }
  
  /* Set the register */
  I2C_WriteDeviceRegister(DeviceAddr, IOE_CAT9554_REG_CONFIG, tmp);
  
  /* If all OK return IOE_OK */
  return IOE_OK;   
}
/**
  * @brief  Configures the input pin polarity invert or not
  * @param  Polarity: could be
  *   @arg  Normal:       
  *   @arg  Invert: input level invert     
  * @param  IO_Pin: The IO interrupt to be configured. This parameter could be any
  *         combination of the following values:
  *   @arg  IO_Pin_x: where x can be from 0 to 7.    
  * @retval IOE_OK: if all initializations are OK. Other value if error.
  */
uint8_t IOE_InPolarConfig(uint8_t DeviceAddr,uint8_t IO_Pin, IOE_BitPolarity_TypeDef PolarityType)
{
  uint8_t tmp = 0;

  /* Get all the Pins Polarity */
  tmp = I2C_ReadDeviceRegister(DeviceAddr, IOE_CAT9554_REG_POLARINV);
  /* Modify the input Polarity configuration */
  if(PolarityType == Invert)
  {
    tmp |= (uint8_t)IO_Pin;
	/* Set the register */
    I2C_WriteDeviceRegister(DeviceAddr, IOE_CAT9554_REG_POLARINV, tmp);
  }
  else
  {	
    tmp &= ~(uint8_t)IO_Pin;
	/* Set the register */
    I2C_WriteDeviceRegister(DeviceAddr, IOE_CAT9554_REG_POLARINV, tmp);
  }	  
  
